# 1.  Створити список цілих чисел, які вводяться з терміналу та визначити серед них максимальне та мінімальне число.

# some_list = int [input("Enter several numbers: ")]
# smallest = min(some_list)
# print(smallest)

# some_list = input.([])
# smallest = min(int(number) for number in some_list
# print(smallest)


# 2.  В інтервалі від 1 до 10 визначити числа 
# •  парні, які діляться на 2,
# •  непарні, які діляться на 3, 
# •  числа, які не діляться на 2 та 3.

# 3.  Написати програму, яка обчислює факторіал числа, яке користувач вводить.(не використовувати рекурсивного виклику функції)